posts/pcap-types-and-sub-types/index.html
<!DOCTYPE html>
<html prefix="og: http://ogp.me/ns# article: http://ogp.me/ns/article# " lang="en">
<head>
<meta charset="utf-8">
<meta name="description" content="The PCAP types and sub-types we need.">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>PCAP Types and Sub-Types | Packet Capture</title>
<link href="../../assets/css/all-nocdn.css" rel="stylesheet" type="text/css">
<meta name="theme-color" content="#5670d4">
<meta name="generator" content="Nikola (getnikola.com)">
<link rel="alternate" type="application/rss+xml" title="RSS" href="../../rss.xml">
<link rel="canonical" href="https://github.com/necromuralist/packet_capture/posts/pcap-types-and-sub-types/">
<!--[if lt IE 9]><![endif]--><meta name="author" content="necromuralist">
<link rel="prev" href="../project-alpaca/" title="Project ALPaCa" type="text/html">
<meta property="og:site_name" content="Packet Capture">
<meta property="og:title" content="PCAP Types and Sub-Types">
<meta property="og:url" content="https://github.com/necromuralist/packet_capture/posts/pcap-types-and-sub-types/">
<meta property="og:description" content="The PCAP types and sub-types we need.">
<meta property="og:type" content="article">
<meta property="article:published_time" content="2018-08-22T12:37:52-07:00">
<meta property="article:tag" content="pcap info">
</head>
<body>
<a href="#content" class="sr-only sr-only-focusable">Skip to main content</a>

<!-- Menubar -->

<nav class="navbar navbar-default navbar-static-top"><div class="container">
<!-- This keeps the margins nice -->
        <div class="navbar-header">
            <button type="button" class="navbar-toggle collapsed" data-toggle="collapse" data-target="#bs-navbar" aria-controls="bs-navbar" aria-expanded="false">
            <span class="sr-only">Toggle navigation</span>
            <span class="icon-bar"></span>
            <span class="icon-bar"></span>
            <span class="icon-bar"></span>
            </button>
            <a class="navbar-brand" href="https://github.com/necromuralist/packet_capture/">

                <span id="blog-title">Packet Capture</span>
            </a>
        </div>
<!-- /.navbar-header -->
        <div class="collapse navbar-collapse" id="bs-navbar" aria-expanded="false">
            <ul class="nav navbar-nav">
<li>
<a href="../">Notes</a>
                </li>
<li>
<a href="../../archive.html">Archive</a>
                </li>
<li>
<a href="../../categories/">Tags</a>
                </li>
<li>
<a href="../../rss.xml">RSS feed</a>

                
            </li>
</ul>
<ul class="nav navbar-nav navbar-right">
<li>
    <a href="index.org" id="sourcelink">Source</a>
    </li>

                
            </ul>
</div>
<!-- /.navbar-collapse -->
    </div>
<!-- /.container -->
</nav><!-- End of Menubar --><div class="container" id="content" role="main">
    <div class="body-content">
        <!--Body content-->
        <div class="row">
            
            
<article class="post-text h-entry hentry postpage" itemscope="itemscope" itemtype="http://schema.org/Article"><header><h1 class="p-name entry-title" itemprop="headline name"><a href="." class="u-url">PCAP Types and Sub-Types</a></h1>

        <div class="metadata">
            <p class="byline author vcard"><span class="byline-name fn" itemprop="author">
                    necromuralist
            </span></p>
            <p class="dateline"><a href="." rel="bookmark"><time class="published dt-published" datetime="2018-08-22T12:37:52-07:00" itemprop="datePublished" title="2018-08-22 12:37">2018-08-22 12:37</time></a></p>
            
        <p class="sourceline"><a href="index.org" class="sourcelink">Source</a></p>

        </div>
        

    </header><div class="e-content entry-content" itemprop="articleBody text">
    <div id="outline-container-orgcfa73ff" class="outline-2">
<h2 id="orgcfa73ff">Background</h2>
<div class="outline-text-2" id="text-orgcfa73ff">
<p>
These are the 802.11 frame types and sub-types you can use to help filter out packets. The types and sub-types are represented in the frames as integers (well, really bits), but it's usually easier to remember the names (maybe).
</p>
</div>
</div>

<div id="outline-container-org634fb18" class="outline-2">
<h2 id="org634fb18">Types</h2>
<div class="outline-text-2" id="text-org634fb18">
<p>
There are three main types that you need.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup>
<col class="org-left">
<col class="org-right">
</colgroup>
<thead><tr>
<th scope="col" class="org-left">Name</th>
<th scope="col" class="org-right">Identifier</th>
</tr></thead>
<tbody>
<tr>
<td class="org-left">Management</td>
<td class="org-right">0</td>
</tr>
<tr>
<td class="org-left">Control</td>
<td class="org-right">1</td>
</tr>
<tr>
<td class="org-left">Data</td>
<td class="org-right">2</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orgf0f2285" class="outline-2">
<h2 id="orgf0f2285">Sub-Types</h2>
<div class="outline-text-2" id="text-orgf0f2285">
<p>
Within each of the types there are sub-types to identify what kind of frames they are. There are a lot of them so I'm only going to list the ones that I think are the most useful right now.
</p>
</div>
</div>

<div id="outline-container-org5bd54f5" class="outline-2">
<h2 id="org5bd54f5">Management</h2>
<div class="outline-text-2" id="text-org5bd54f5">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup>
<col class="org-left">
<col class="org-right">
</colgroup>
<thead><tr>
<th scope="col" class="org-left">Name</th>
<th scope="col" class="org-right">Identifier</th>
</tr></thead>
<tbody>
<tr>
<td class="org-left">Association Request</td>
<td class="org-right">0</td>
</tr>
<tr>
<td class="org-left">Association Response</td>
<td class="org-right">1</td>
</tr>
<tr>
<td class="org-left">Reassociation Request</td>
<td class="org-right">2</td>
</tr>
<tr>
<td class="org-left">Reassociation Response</td>
<td class="org-right">3</td>
</tr>
<tr>
<td class="org-left">Probe Request</td>
<td class="org-right">4</td>
</tr>
<tr>
<td class="org-left">Probe Response</td>
<td class="org-right">5</td>
</tr>
<tr>
<td class="org-left"><i>Reserved</i></td>
<td class="org-right">6</td>
</tr>
<tr>
<td class="org-left"><i>Reserved</i></td>
<td class="org-right">7</td>
</tr>
<tr>
<td class="org-left">Beacon</td>
<td class="org-right">8</td>
</tr>
<tr>
<td class="org-left">Announcement Traffic Indication Message (ATIM)</td>
<td class="org-right">9</td>
</tr>
<tr>
<td class="org-left">Disassociate</td>
<td class="org-right">10</td>
</tr>
<tr>
<td class="org-left">Authentication</td>
<td class="org-right">11</td>
</tr>
<tr>
<td class="org-left">Deauthentication</td>
<td class="org-right">12</td>
</tr>
</tbody>
</table>
</div>
</div>
    </div>
    <aside class="postpromonav"><nav><ul itemprop="keywords" class="tags">
<li><a class="tag p-category" href="../../categories/pcap-info/" rel="tag">pcap info</a></li>
        </ul>
<ul class="pager hidden-print">
<li class="previous">
                <a href="../project-alpaca/" rel="prev" title="Project ALPaCa">Previous post</a>
            </li>
        </ul></nav></aside></article>
</div>
        <!--End of body content-->

        <footer id="footer">
            Contents © 2018         <a href="mailto:necromuralist@protonmail.com">necromuralist</a> - Powered by         <a href="https://getnikola.com" rel="nofollow">Nikola</a>         
            
        </footer>
</div>
</div>


            <script src="../../assets/js/all-nocdn.js"></script><script>$('a.image-reference:not(.islink) img:not(.islink)').parent().colorbox({rel:"gal",maxWidth:"100%",maxHeight:"100%",scalePhotos:true});</script><!-- fancy dates --><script>
    moment.locale("en");
    fancydates(0, "YYYY-MM-DD HH:mm");
    </script><!-- end fancy dates -->
</body>
</html>
